#include <stdio.h>
#include <stdbool.h>

int main(){
    // bool b=6<5;
    // bool t=true;
    // t=2;
    // printf("%d %d\n",b,t);

    int a=-1;
    if(a>0&&a++>1){//a++并没有执行
        printf("OK");
    }
    printf("%d",a);//短路：逻辑从左向右，左边已经得出结果就不会做右边的运算
                    //&&，左边是false就不执行右边
                    //||，左边是true就不执行右边

    return 0;
}
/*
逻辑运算是对逻辑量进行的运算，结果0或1
逻辑量是关系运算或逻辑运算的结果

运算符
!   逻辑非
&&  逻辑与，*，都是true，结果为true
||  逻辑或，+，

逻辑运算符的优先级低于比较运算符
但!逻辑非是单目运算符，优先级比双目运算符高，!age<20结果为1。!age要么是0，要么是1
优先级：!>&&>||

运算符优先级：()>单目>乘除加减>比较>逻辑>赋值
1   ()  从左到右
2   !,+,-,++,-- 从右到左，(单目的+-)
3   *,/,%   从左到右
4   +,- 从左到右
5   <,<=,>,>=   从左到右
6   ==,!=   从左到右
7   &&  从左到右
8   ||  从左到右
9   =,+=,-=,*=,/=,%=    从右到左

*/
